Tekla.Structures.Datatype.BooleanConverter
The BooleanConverter class converts types to and from the boolean type.

Tekla.Structures.Datatype.BooleanConverter.CanConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Type)
Checks whether the conversion can be made from the source type to the boolean type.
context: The context.
sourceType: The type to convert from.
Returns: True if possible, false if not possible.

Tekla.Structures.Datatype.BooleanConverter.CanConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Type)
Checks whether the conversion can be made from the boolean type to the destination type.
context: The context.
destinationType: The type to convert to.
Returns: True if possible, false if not possible.

Tekla.Structures.Datatype.BooleanConverter.ConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object)
Converts an object from the given culture to the boolean type.
context: The context.
culture: The culture.
value: The object to be converted.
Returns: The new boolean object.

Tekla.Structures.Datatype.BooleanConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)
Converts an object from the boolean type to the given destination type.
context: The context.
culture: The target culture.
value: The boolean object to be converted.
destinationType: The destination type.
Returns: The given boolean object converted to the new type.